public/peter/vita-gentile/index.html
<!DOCTYPE html>
<html lang="en">
<head>  <meta charset="UTF-8">
  <meta name="viewport" content="width=device-width, initial-scale=1">
  <link rel="stylesheet" href="/css/gtd.css">
  
  
</head>
<body>
  
<main>
  <div style="margin: 1rem;">
    <a href="/" style="
      display: inline-block;
      background-color: #eee;
      color: #333;
      padding: 0.4rem 0.8rem;
      border-radius: 6px;
      text-decoration: none;
      font-weight: bold;
      font-family: sans-serif;
      font-size: 0.9rem;
    ">
      ← Homepage
    </a>

  <title>Queztaz/Operazione: Vita Gentile</title>
  <h1>Operazione: Vita Gentile</h1>

  </div>
  <nav class="toc">
    <nav id="TableOfContents">
<ul>
<li><a href="#headline-1">Operazione: Vita Gentile</a>
<ul>
<li><a href="#headline-2">Preamble</a>
</li>
<li><a href="#headline-3">Life Style Changes</a>
</li>
<li><a href="#headline-4">Letter Mail</a>
</li>
<li><a href="#headline-5">Phone Number</a>
</li>
<li><a href="#headline-6">Portable Computer System</a>
</li>
<li><a href="#headline-7">Moving to Cloud</a>
</li>
</ul>
</li>
<li><a href="#headline-8">Projects</a>
<ul>
<li><a href="#headline-9">Privacy Computer</a>
</li>
</ul>
</li>
</ul>
</nav>
  </nav> 

  <article>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Operazione: Vita Gentile
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<div id="outline-container-headline-2" class="outline-3">
<h3 id="headline-2">
Preamble
</h3>
<div id="outline-text-headline-2" class="outline-text-3">
<p>General scratch buffer for offloading my brain. The contents do not aim to make
sense and they will be dynamically changing as time goes on.</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-3">
<h3 id="headline-3">
Life Style Changes
</h3>
</div>
<div id="outline-container-headline-4" class="outline-3">
<h3 id="headline-4">
Letter Mail
</h3>
<div id="outline-text-headline-4" class="outline-text-3">
<p>Mail sucks. I don&#39;t want or ask for any of it.</p>
<p>
My letter mail is digitized and viewable through my web browser. I no longer
receive any physical mail to my address. The service used is US Global Mail. It
costs $30/month. Lettermail is scanned and downloadable as PDF</p>
<p>
I don&#39;t need to worry about being at a particular place to view my mail. I am
free to go anywhere in the world without concern.</p>
</div>
</div>
<div id="outline-container-headline-5" class="outline-3">
<h3 id="headline-5">
Phone Number
</h3>
<div id="outline-text-headline-5" class="outline-text-3">
<p>We need phones for everything. I don&#39;t want to need a phone for something stupid
like a 2FA text. I&#39;d rather use my computer for that. This system is pretty
sleek and saves me money and freedom. I&#39;ll articulate later : )</p>
<p>
I ported my phone number to Google Voice. Now I have a reliable VOIP number. The
only thing my phone relies now is a web browser and internet connection. My
phone can have any data plan it wants. It could even be a data only sim and I
wouldn&#39;t notice the difference.</p>
<p>
I have the freedom to remove phones from my life.</p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-3">
<h3 id="headline-6">
Portable Computer System
</h3>
<div id="outline-text-headline-6" class="outline-text-3">
<p>I don&#39;t want to be reliant on having a &#34;personal&#34; computer. I want my computer
to be accessible everywhere I go.</p>
<p>
I use my Android phone as a desktop through DexMode. With my work flow, it
functions the exact same a computer would. The phone connects via a USB-C dock
into a portable 1080P monitor. I enjoy the life proof case on it ¯\_(ツ)_/¯</p>
<p>
I SSH into a remote box to runs my emacs elisp interpreter. This application has
simplified my entire digital workflow. All of my applications and platforms I
interface with can be done with emacs. This one application accounts for all the
software I use.</p>
<p>
Instantly I can have the same browsing experience mirrored on any computer I
touch. I mostly use the Terminal extension for Google Chrome to connect. My
digital life has no dependencies, both physically and with software. I feel
really good about it. Zero stress or thought goes into how work.</p>
</div>
</div>
<div id="outline-container-headline-7" class="outline-3">
<h3 id="headline-7">
Moving to Cloud
</h3>
<div id="outline-text-headline-7" class="outline-text-3">
<p>I&#39;m a simple person. I want my data to be easy to access in a way that&#39;s smart.</p>
<p>
Google Workspace hosts my custom email and now all my file storage. I really
like how Gmail labels operate. The philosophy behind it makes sense, which is
becoming a more frequent of an experience using Google Products.</p>
<p>
My files I can access offline using the Google Drive desktop client for
Windows. My document processing doesn&#39;t require another application be
installed. All my work is centralized in my web browser OR any remote terminal.</p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-8" class="outline-2">
<h2 id="headline-8">
Projects
</h2>
<div id="outline-text-headline-8" class="outline-text-2">
<div id="outline-container-headline-9" class="outline-3">
<h3 id="headline-9">
Privacy Computer
</h3>
<div id="outline-text-headline-9" class="outline-text-3">
<p>I used to use a Thinkpad X60 with Libreboot and a TTY only system. This was
painful. Web browsing was only done through TOR, mostly because Javascript would
peg the CPU.</p>
<p>
I corebooted a Thinkpad X200 with disk encryptino. This can boot into a Tails
USB. I&#39;d say this is a pretty simple setup with fantastic anonymity.</p>
</div>
</div>
</div>
</div>

  </article>
</main>

</body>
</html>
